Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMD20_DFP/3.0.20/samd20/edc/ATSAMD20J15.PIC
    <edc:Pin>
      <edc:VirtualPin edc:name="PA11" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT11" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="AIN19" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="X3" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="IO5" edc:ppsfunction="H"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDIO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GNDIO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB10" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT10" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="IO4" edc:ppsfunction="H"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB11" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT11" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="IO5" edc:ppsfunction="H"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB12" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT12" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="X12" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="IO6" edc:ppsfunction="H"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB13" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT13" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="X13" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PAD1" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="IO7" edc:ppsfunction="H"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB14" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT14" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="X14" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="IO0" edc:ppsfunction="H"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB15" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT15" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="X15" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="IO1" edc:ppsfunction="H"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA12" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT12" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="CMP0" edc:ppsfunction="H"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA13" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT13" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PAD1" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PAD1" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="CMP1" edc:ppsfunction="H"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA14" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT14" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="IO0" edc:ppsfunction="H"/>
      <edc:VirtualPin edc:name="XIN" edc:ppsfunction="XIN"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA15" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT15" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="IO1" edc:ppsfunction="H"/>
      <edc:VirtualPin edc:name="XOUT" edc:ppsfunction="XOUT"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GNDIO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDIO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA16" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="X4" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="IO2" edc:ppsfunction="H"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA17" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="X5" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PAD1" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PAD1" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="IO3" edc:ppsfunction="H"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA18" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT2" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="X6" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="CMP0" edc:ppsfunction="H"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA19" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT3" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="X7" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="CMP1" edc:ppsfunction="H"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB16" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="IO2" edc:ppsfunction="H"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB17" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PAD1" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="IO3" edc:ppsfunction="H"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA20" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT4" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="X8" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="IO4" edc:ppsfunction="H"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA21" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT5" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="X9" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="IO5" edc:ppsfunction="H"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA22" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT6" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="X10" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="IO6" edc:ppsfunction="H"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA23" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT7" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="X11" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PAD1" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PAD1" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="IO7" edc:ppsfunction="H"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA24" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT12" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="F"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA25" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT13" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="F"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GNDIO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDIO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB22" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT6" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="IO0" edc:ppsfunction="H"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB23" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT7" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="IO1" edc:ppsfunction="H"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA27" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT15" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="IO0" edc:ppsfunction="H"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RESET_N" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA28" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT8" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="IO0" edc:ppsfunction="H"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GNDIO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDCORE"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDIN"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA30" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT10" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="IO0" edc:ppsfunction="H"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA31" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT11" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="F"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB30" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT14" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="F"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB31" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT15" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PAD1" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="F"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB00" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="AIN8" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="Y6" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="F"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB01" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="AIN9" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="Y7" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="F"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB02" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT2" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="AIN10" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="Y8" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="F"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB03" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT3" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="AIN11" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="Y9" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PAD1" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="F"/>
    </edc:Pin>
  </edc:PinList>
</edc:PIC>
